In [1]:
import pandas as pd

# 创建Series

In [5]:
name = pd.Series(["小陈","小季","小生","小张","小赵","小周"],index = ["001","002","003","004","005","006"])
gender = pd.Series(["女","女","男","男","女","男"],index = ["006","005","004","003","002","001"])
height = pd.Series([172.5,168.0,178.2,181.3,161.7],index = ["001","002","003","004","005"])
print(name)
print(gender)
print(height)

001    小陈
002    小季
003    小生
004    小张
005    小赵
006    小周
dtype: object
006    女
005    女
004    男
003    男
002    女
001    男
dtype: object
001    172.5
002    168.0
003    178.2
004    181.3
005    161.7
dtype: float64

# 创建DataFrame

In [7]:
students = pd.DataFrame({"姓名":name,"性别":gender,"身高":height})
students

     姓名 性别     身高
001  小陈  男  172.5
002  小季  女  168.0
003  小生  男  178.2
004  小张  男  181.3
005  小赵  女  161.7
006  小周  女    NaN

# 打印DataFrame所有索引和列名

In [8]:
print(students.index)
print(students.columns)

Index(['001', '002', '003', '004', '005', '006'], dtype='object')
Index(['姓名', '性别', '身高'], dtype='object')

# 将DataFrame的行和列进行转置

In [9]:
students.T

      001    002    003    004    005  006
姓名     小陈     小季     小生     小张     小赵   小周
性别      男      女      男      男      女    女
身高  172.5  168.0  178.2  181.3  161.7  NaN

# 输出一列

In [10]:
students["身高"]

001    172.5
002    168.0
003    178.2
004    181.3
005    161.7
006      NaN
Name: 身高, dtype: float64

# 输出两列

In [11]:
students[["性别","身高"]]

    性别     身高
001  男  172.5
002  女  168.0
003  男  178.2
004  男  181.3
005  女  161.7
006  女    NaN

# 根据索引输出一行

In [14]:
students.loc["003"]

姓名       小生
性别        男
身高    178.2
Name: 003, dtype: object

# 根据索引输出多行

In [15]:
students.loc["003":"005"]

     姓名 性别     身高
003  小生  男  178.2
004  小张  男  181.3
005  小赵  女  161.7

# 输出特定位置的值

In [16]:
students.loc["005","身高"]

np.float64(161.7)

# 输出多个特定位置的值

In [17]:
students.loc[["003","005"],["姓名","身高"]]

     姓名     身高
003  小生  178.2
005  小赵  161.7

# 输出特定行

In [18]:
students.loc[["003","005"],:]

     姓名 性别     身高
003  小生  男  178.2
005  小赵  女  161.7

# 对DataFrame进行逻辑操作

In [19]:
students[(students["身高"]>165) & (students["性别"] == "女")]

     姓名 性别     身高
002  小季  女  168.0

# 通过head方法，输出前五行数据

In [20]:
students.head()

     姓名 性别     身高
001  小陈  男  172.5
002  小季  女  168.0
003  小生  男  178.2
004  小张  男  181.3
005  小赵  女  161.7